{"status":"ok","totalResults":2573,"articles":[{"source":{"id":null,"name":"Lifehacker.com"},"author":"Brendan Hesse","title":"Sound Like Darth Vader, T-Pain and More With the Voicemod App for iOS and Android","description":"The popular voice-altering PC software Voicemod is now available as a free app on iOS/iPadOS and Android, making it that much easier to change up your sound to create silly messages, quickly add voice effects to videos and maybe pull lighthearted pranks on yo…","url":"https://lifehacker.com/sound-like-darth-vader-t-pain-and-more-with-the-voicem-1844471739","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/krei5txalxihxln73bvu.png","publishedAt":"2020-07-22T21:00:00Z","content":"The popular voice-altering PC software Voicemod is now available as a free app on iOS/iPadOS and Android, making it that much easier to change up your sound to create silly messages, quickly add voic… [+2926 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Christine Fisher","title":"Italy is launching an antitrust investigation into Amazon and Apple","description":"Amazon and Apple are facing more antitrust accusations. This time, Italy is investigating. Authorities want to know whether the two companies agreed to prevent retailers who are not part of Apple’s official program to sell Apple products and Beats headphones,…","url":"https://www.engadget.com/amazon-apple-italy-antitrust-investigation-141046089.html","urlToImage":"https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-07%2F8f59d3b0-cc20-11ea-b6ed-fefc710c9726&client=amp-blogside-v2&signature=31766a493764ff2e434a6519840492e682c1f50e","publishedAt":"2020-07-22T14:10:46Z","content":"This is certainly not the first time officials have raised concerns about the companies’ practices. In the US, Amazon, Apple, Facebook and Google are facing a federal antitrust probe, and the company… [+559 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Nicole Lee","title":"Apple will provide 'hacker-friendly' phones to security researchers","description":"Apple has claimed for years that its devices are more secure than the competition, but it was often through restricting access to its software. Now, however, the company is ready to take a different tack. It will begin loaning out special “Security Research D…","url":"https://www.engadget.com/apple-iphone-hacker-friendly-security-183536979.html","urlToImage":"https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-07%2F5c2bd6f0-cc48-11ea-b7bf-47cb966b1aae&client=amp-blogside-v2&signature=acb2fef7a86c167f2ebdb1da7ba4b181e2235d7d","publishedAt":"2020-07-22T18:35:36Z","content":"The company said that if researchers found a vulnerability through using the SRD, it must report it to Apple or an appropriate third party if it’s in a third-party code. Apple will then attempt to re… [+742 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Mariella Moon","title":"Microsoft outlines its plan to become carbon negative by 2030","description":"Microsoft has revealed how it plans to fulfill its pledge to become a carbon negative company by 2030. The tech giant first announced that it intends implement aggressive measures to remove more carbon from the atmosphere than it creates back in January. It a…","url":"https://www.engadget.com/microsoft-carbon-negative-2030-steps-093047774.html","urlToImage":"https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-03%2Fb7748150-7299-11ea-bfbe-dc5ee1ecd17b&client=amp-blogside-v2&signature=ca88259422e1984494284fd8cc061f21099b48a1","publishedAt":"2020-07-22T09:30:47Z","content":"The company has also started to work on removing its historical emissions, starting by taking concrete steps to remove 1 million metric tons of carbon from the environment this fiscal year. It promis… [+937 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Igor Bonifacic","title":"Lenovo's first gaming phone has a camera on the side and two batteries","description":"When it comes to gaming phones, we've seen some unusual designs. Take the Nubia Red Magic 3, for instance: It featured a built-in cooling fan, of all things. But for its first gaming phone, the recently leaked Legion Phone Duel, Lenovo has found a way to make…","url":"https://www.engadget.com/lenovo-legion-phone-duel-113045249.html","urlToImage":"https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-07%2F826a8d30-cb98-11ea-ad7f-d0af1ee012ca&client=amp-blogside-v2&signature=14685d19ecee31907391bb8be1bfd674224df2e0","publishedAt":"2020-07-22T11:30:45Z","content":"When it comes to the Duel's other cameras, Lenovo played it safer. For its primary camera, the phone has a dual array that consists of a 64-megapixel sensor paired with an f/1.89 aperture lens and a … [+2923 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Darrell Etherington","title":"Adding an external GPU to your Mac is probably a better upgrade option than getting a new one","description":"Apple recently announced that they would be transition their Mac line from Intel processors to their own, ARM-based Apple Silicon. That process is meant to begin with hardware to be announced later this year, and last two years according to Apple’s stated exp…","url":"http://techcrunch.com/2020/07/22/adding-an-external-gpu-to-your-mac-is-probably-a-better-upgrade-option-than-getting-a-new-one/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/07/https-hybrismediaprod.blob_.core_.windows.net-sys-master-phoenix-images-container-he9-h03-9011281788958-razer-core-x-chroma-gallery-hero.jpg?w=600","publishedAt":"2020-07-22T13:58:50Z","content":"Apple recently announced that they would be transition their Mac line from Intel processors to their own, ARM-based Apple Silicon. That process is meant to begin with hardware to be announced later t… [+7852 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Zack Whittaker","title":"Apple starts giving ‘hacker-friendly’ iPhones to top bug hunters","description":"For the past decade Apple has tried to make the iPhone one of the most secure devices on the market. By locking down its software, Apple keeps its two billion iPhone owners safe. But security researchers say that makes it impossible to look under the hood to …","url":"http://techcrunch.com/2020/07/22/apple-hacker-friendly-iphone-security/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/07/apple-ios-security.jpg?w=596","publishedAt":"2020-07-22T17:00:07Z","content":"For the past decade Apple has tried to make the iPhone one of the most secure devices on the market. By locking down its software, Apple keeps its two billion iPhone owners safe. But security researc… [+3725 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Sarah Perez","title":"Apple digs in heels over its App Store commission structure with release of new study","description":"Apple today is again taking to the press to fight back against claims of anti-competitive practices on its App Store. Last month, the company detailed the results of a commissioned study which showed how Apple wasn’t receiving a cut of revenue on the majority…","url":"http://techcrunch.com/2020/07/22/apple-digs-in-heels-over-its-app-store-commission-structure-with-release-of-new-study/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/10/app-store-icon-2.jpg?w=712","publishedAt":"2020-07-22T17:11:44Z","content":"Apple today is again taking to the press to fight back against claims of anti-competitive practices on its App Store. Last month, the company detailed the results of a commissioned study which showed… [+6043 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"Jamf’s IPO underscores hot demand for tech shares","description":"After the bell yesterday, Apple-device management company Jamf announced its final IPO pricing. We’ve been tracking the Jamf IPO for some time, as it is yet another example of a technology company worth $1 billion or more going public during the COVID-19 pand…","url":"http://techcrunch.com/2020/07/22/jamfs-ipo-underscores-hot-demand-for-tech-shares/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/05/NSussman_Techcrunch_Exchange_v3_RD.jpg?w=533","publishedAt":"2020-07-22T14:15:31Z","content":"After the bell yesterday, Apple-device management company Jamf announced its final IPO pricing. We’ve been tracking the Jamf IPO for some time, as it is yet another example of a technology company wo… [+2021 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Anthony Ha","title":"Daily Crunch: Slack files antitrust complaint against Microsoft","description":"An antitrust battle is brewing between Microsoft and Slack, Apple continues to defend its App Store policies and Dexterity raises funding for warehouse robots. Here’s your Daily Crunch for July 22, 2020. PS: I’m going to be on vacation until Wednesday of next…","url":"http://techcrunch.com/2020/07/22/daily-crunch-slack-microsoft-antitrust/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-1151015325.jpg?w=600","publishedAt":"2020-07-22T22:16:02Z","content":"An antitrust battle is brewing between Microsoft and Slack, Apple continues to defend its App Store policies and Dexterity raises funding for warehouse robots. Here’s your Daily Crunch for July 22, 2… [+3374 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"Go SPAC yourself","description":"Hello everyone, it’s a busy week with TechCrunch Early Stage underway and a slew of tech earnings to parse through. But that didn’t stop the Equity crew from sitting down to chat about the recent wave of SPAC commentary Danny and I wanted to talk about what a…","url":"http://techcrunch.com/2020/07/22/go-spac-yourself/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/12/equity-podcast-2019-phone-1-2-e1576159337785.jpg?w=300","publishedAt":"2020-07-22T18:38:00Z","content":"Hello everyone, it’s a busy week with TechCrunch Early Stage underway and a slew of tech earnings to parse through. But that didn’t stop the Equity crew from sitting down to chat about the recent wav… [+1533 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Natasha Lomas","title":"Slack has filed an antitrust complaint against Microsoft Teams in the EU","description":"Workplace instant messaging platform Slack has filed an antitrust complaint against Microsoft in the European Union accusing the tech giant of unfairly bundling its rival Teams product with its cloud-based productivity suite. A spokeswoman for the Commission’…","url":"http://techcrunch.com/2020/07/22/slack-has-filed-an-antitrust-complaint-against-microsoft-teams-in-the-eu/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1211180761.jpg?w=600","publishedAt":"2020-07-22T14:13:49Z","content":"Workplace instant messaging platform Slack has filed an antitrust complaint against Microsoft in the European Union accusing the tech giant of unfairly bundling its rival Teams product with its cloud… [+5310 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Victoria Song","title":"Apple Glasses Rumors Have Me Stressed About AR's Biggest Unsolved Problems","description":"The hype behind Apple’s rumored augmented reality headset and glasses just won’t die. Every few weeks, almost like clockwork, some sort of Apple AR rumor or news makes its way through the tech blogosphere, even as other smart glasses and AR companies are caps…","url":"https://gizmodo.com/apple-glasses-rumors-have-me-stressed-about-ars-biggest-1844466131","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/xxohibfyfy92s0thpk5d.jpg","publishedAt":"2020-07-22T17:00:00Z","content":"The hype behind Apples rumored augmented reality headset and glasses just wont die. Every few weeks, almost like clockwork, some sort of Apple AR rumor or news makes its way through the tech blogosph… [+4938 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sam Rutherford","title":"The Razer Blade 15 Advanced Is the MacBook Pro of Gaming Laptops","description":"For years I’ve considered the Razer Blade 15 to be the closest thing you can get to a MacBook Pro for gamers. Sure, it doesn’t run macOS, but no other non-Apple computer does either, at least not legally. Like a MacBook Pro, the Razer Blade 15 has an understa…","url":"https://gizmodo.com/the-razer-blade-15-advanced-is-the-macbook-pro-of-gamin-1844396810","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/eh9dpincobj29f3cffyp.jpg","publishedAt":"2020-07-22T13:00:00Z","content":"For years Ive considered the Razer Blade 15 to be the closest thing you can get to a MacBook Pro for gamers. Sure, it doesnt run macOS, but no other non-Apple computer does either, at least not legal… [+6498 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Andrew Liszewski","title":"This Depth-Sensing, Laser Measuring, Touchscreen Drill Is the Smartphone of Power Tools","description":"Despite companies desperately trying to come up with reasons to add a screen to every appliance in your house, your fridge and toaster probably work just fine the way they are. And while a drill with a touchscreen also seems like complete overkill, the creato…","url":"https://gizmodo.com/this-depth-sensing-laser-measuring-touchscreen-drill-1844466865","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zjpepbe9sx34olpfe8kf.gif","publishedAt":"2020-07-22T14:50:00Z","content":"Despite companies desperately trying to come up with reasons to add a screen to every appliance in your house, your fridge and toaster probably work just fine the way they are. And while a drill with… [+3324 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Bryan Menegus","title":"Microsoft's Doing the Monopoly Thing Again, Slack Says","description":"Workplace messaging software company Slack is accusing Microsoft of monopoly behavior in an antitrust complaint filed today to European Union regulators. Unsurprisingly, the accusations hinge on the same practice that helped make Microsoft rich in the first p…","url":"https://gizmodo.com/microsofts-doing-the-monopoly-thing-again-slack-says-1844469281","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cqndvmjttenentlhedoi.jpg","publishedAt":"2020-07-22T17:50:00Z","content":"Workplace messaging software company Slack is accusing Microsoft of monopoly behavior in an antitrust complaint filed today to European Union regulators. Unsurprisingly, the accusations hinge on the … [+2775 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"David Nield","title":"How to Create the Perfect Two-Computer Setup","description":"For the longest time, one computer has been enough to do it all. But its never been easier to get a cheap computer, and a second machine can do everything from help you code across multiple platforms to run lots of taxing programs at once, or just give you a …","url":"https://gizmodo.com/how-to-create-the-perfect-two-computer-setup-1844448073","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/swzsuxrkbgcrnfofjd9f.jpg","publishedAt":"2020-07-22T12:30:00Z","content":"For the longest time, one computer has been enough to do it all. But its never been easier to get a cheap computer, and a second machine can do everything from help you code across multiple platforms… [+8084 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sam Rutherford","title":"The Asus ROG Phone 3 Is a Delightful Affront to Phone Design","description":"A lot of gaming phones fail to differentiate themselves from standard smartphone fare. But that’s not a problem for Asus’ new ROG Phone 3, which has massive specs, in your face RGB lighting, and possibly the most responsive performance I’ve ever experienced i…","url":"https://gizmodo.com/the-asus-rog-phone-3-is-a-delightful-affront-to-phone-d-1844460276","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bbm7aghsuthj2pi3yg6d.jpg","publishedAt":"2020-07-22T15:30:00Z","content":"A lot of gaming phones fail to differentiate themselves from standard smartphone fare. But thats not a problem for Asus new ROG Phone 3, which has massive specs, in your face RGB lighting, and possib… [+5751 chars]"},{"source":{"id":null,"name":"Theinventory.com"},"author":"The Inventory Staff on Kinja Deals, shared by Ignacia to Gizmodo","title":"Wednesday's Best Deals: Anker Bluetooth Speaker, 1More ColorBuds, Shenmue III, NeoGeo Mini, Kyoku Nakiri Knife, Ray-Ban Sunglasses, Dash Air Fryer, and More","description":"An Anker Bluetooth speaker, a marked down pair of 1More ColorBuds, a rare discount on Shenmue III, a NeoGeo Mini International Edition console, a Kyoku Japanese Nakiri knife, a one-day sale on Ray-Ban sunglasses, and a Dash AirCrisp Pro air fryer lead Wednesd…","url":"https://kinjadeals.theinventory.com/wednesdays-best-deals-anker-bluetooth-speaker-1more-c-1844465886","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i2de0kmoksuv4b70n1ku.jpg","publishedAt":"2020-07-22T14:30:00Z","content":"An Anker Bluetooth speaker, a marked down pair of 1More ColorBuds, a rare discount on Shenmue III, a NeoGeo Mini International Edition console, a Kyoku Japanese Nakiri knife, a one-day sale on Ray-Ba… [+53547 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Brenda Stolyar","title":"Some of the stunning winners of the 2020 iPhone Photography Awards","description":"After poring over thousands of images from iPhone photographers in more than 140 countries around the world, judges have declared the results for the 13th Annual iPhone Photography Awards (IPPAWARDS). And the photos are beautiful.\nI want to say I'm surprised …","url":"https://mashable.com/article/iphone-photography-awards-2020-winners/","urlToImage":"https://mondrian.mashable.com/2020%252F07%252F22%252Fa0%252F2dccbd6315df469f85cae5307aac53b5.9d338.jpg%252F1200x630.jpg?signature=kvdCjraJRaOv5DEGSagjP9bd6hI=","publishedAt":"2020-07-22T13:00:00Z","content":"After poring over thousands of images from iPhone photographers in more than 140 countries around the world, judges have declared the results for the 13th Annual iPhone Photography Awards (IPPAWARDS)… [+2905 chars]"}]}